; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-65)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b19)
    (on b19 b12)
    (on b12 b5)
    (on b5 b11)
    (on b11 b7)
    (on b7 b13)
    (on b13 b1)
    (on b1 b6)
    (on b6 b15)
    (on b15 b2)
    (on-table b2)
    (clear b3)
    (on b3 b8)
    (on b8 b18)
    (on b18 b10)
    (on b10 b4)
    (on b4 b9)
    (on b9 b17)
    (on b17 b14)
    (on-table b14))
 (:goal (and 
(clear b16) (on b16 b5)
))
)

; plan
1. (unstack b16 b19)
   deleted: (on b16 b19) (clear b16) (arm-empty)
   added: (holding b16) (clear b19)
   goals met: 0 of 2
2. (stack b16 b3)
   deleted: (clear b3) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b3)
   goals met: 1 of 2
3. (unstack b19 b12)
   deleted: (on b19 b12) (clear b19) (arm-empty)
   added: (holding b19) (clear b12)
   goals met: 1 of 2
4. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 2
5. (unstack b12 b5)
   deleted: (on b12 b5) (clear b12) (arm-empty)
   added: (holding b12) (clear b5)
   goals met: 1 of 2
6. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 2
7. (unstack b16 b3)
   deleted: (on b16 b3) (clear b16) (arm-empty)
   added: (holding b16) (clear b3)
   goals met: 0 of 2
8. (stack b16 b5)
   deleted: (clear b5) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b5)
   goals met: 2 of 2
